{
  "categories": {},
  "_examples": {
    "_note": "These are example knowledge categories. Copy the structure to 'categories' and customize.",
    "category_structure": {
      "category_id": {
        "id": "category_id",
        "description": "Description of what this category covers",
        "depths": {
          "0": "Basic/common knowledge (everyone knows this)",
          "1": "Intermediate knowledge (most locals know this)",
          "2": "Detailed knowledge (informed people know this)",
          "3": "Secret/rare knowledge (few know this)"
        }
      }
    },
    "example_world_history": {
      "id": "world_history",
      "description": "Major historical events and eras in this world",
      "depths": {
        "0": "The Great War happened 100 years ago. The kingdom has been at peace since.",
        "1": "The Great War was between the Northern Alliance and Southern Kingdoms. It ended with the Treaty of Silverbrook.",
        "2": "The war began over control of the Silverbrook mines. King Aldric III led the Northern forces. The treaty ceded mining rights but preserved borders.",
        "3": "General Thorne Blackwood committed atrocities at the Siege of Millhaven that official histories omit. Some veterans still remember."
      }
    },
    "example_local_gossip": {
      "id": "local_gossip",
      "description": "Rumors, scandals, and social dynamics in the local area",
      "depths": {
        "0": "The mayor is well-liked. The tavern serves good ale.",
        "1": "The mayor's son has been sneaking out at night. The blacksmith and baker are feuding over land.",
        "2": "The mayor's son is meeting someone at the old mill. The blacksmith claims the baker's grandfather stole land during the flood.",
        "3": "The mayor's son is involved with a merchant's daughter - scandalous given his arranged engagement to the duke's niece."
      }
    },
    "example_trade_knowledge": {
      "id": "trade_knowledge",
      "description": "Economic information, prices, and merchant networks",
      "depths": {
        "0": "Goods can be bought and sold at the market.",
        "1": "Prices fluctuate seasonally. Iron is expensive due to mine closures.",
        "2": "The Merchant Guild controls most trade routes. Independent traders pay fees or risk 'accidents'.",
        "3": "Guild Master Vance has a secret deal with Northern smugglers. The mine closures were engineered to drive up prices."
      }
    },
    "example_magic_lore": {
      "id": "magic_lore",
      "description": "Knowledge about magic systems, spells, and practitioners",
      "depths": {
        "0": "Magic exists. Wizards live in towers. Don't anger them.",
        "1": "Magic is divided into elemental schools: fire, water, earth, air. The Academy trains practitioners.",
        "2": "True power comes from combining schools. The Archmage can wield all four. Blood magic is forbidden.",
        "3": "The ban on blood magic hides the truth: it's not inherently evil, but was used to create the undying king centuries ago."
      }
    }
  }
}
